# Pandas Introduction

In [1]:
import pandas as pd
import numpy as np

## Series

In [2]:
l=[1,2,3,4,5,6,7,8,9,10]
arr=np.array(l)
s1=pd.Series(l)
s1

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [3]:
label=list("absdefghij")
label

['a', 'b', 's', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [7]:
s2=pd.Series(arr, index=label, name="demo")
s2+1000

a    1001
b    1002
s    1003
d    1004
e    1005
f    1006
g    1007
h    1008
i    1009
j    1010
Name: demo, dtype: int64

In [5]:
s1[0], s1.loc[0], s1.iloc[0]

(np.int64(1), np.int64(1), np.int64(1))

In [6]:
s2[0], s2["a"], s2.loc["a"], s2.iloc[0], s2["a":"d"]

/tmp/ipykernel_103971/1538307843.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  s2[0], s2["a"], s2.loc["a"], s2.iloc[0], s2["a":"d"]

(np.int64(1),
 np.int64(1),
 np.int64(1),
 np.int64(1),
 a    1
 b    2
 s    3
 d    4
 Name: demo, dtype: int64)

In [8]:
s2.describe()

count    10.00000
mean      5.50000
std       3.02765
min       1.00000
25%       3.25000
50%       5.50000
75%       7.75000
max      10.00000
Name: demo, dtype: float64

In [9]:
s2.info()

<class 'pandas.core.series.Series'>
Index: 10 entries, a to j
Series name: demo
Non-Null Count  Dtype
--------------  -----
10 non-null     int64
dtypes: int64(1)
memory usage: 460.0+ bytes

# Dataframe

In [10]:
pd.DataFrame()

Empty DataFrame
Columns: []
Index: []

In [12]:
d={
    "age": [10, 12, 16, 16, 9],
    "height": [120, 130, 140, 150, 110],    

}
df = pd.DataFrame(d)
df

   age  height
0   10     120
1   12     130
2   16     140
3   16     150
4    9     110

In [16]:

l=[
    [10, 12, 16, 16, 9],
    [120, 130, 140, 150, 110]
]
arr=np.array(l).T
df = pd.DataFrame(arr, columns=["age", "height"])
df

   age  height
0   10     120
1   12     130
2   16     140
3   16     150
4    9     110

In [17]:
l=[
    # [10, 12, 16, 16, 9],
    # [120, 130, 140, 150, 110]
    [10, 120],
    [12, 130],
    [16, 140],
    [16, 150],
    [9, 110]
]
df = pd.DataFrame(l, columns=["age", "height"])
df

   age  height
0   10     120
1   12     130
2   16     140
3   16     150
4    9     110

In [18]:
d={
    "age": [10, 12, 16, 16, 9],
    "height": [120, 130, 140, 150, 110],    

}
df1 = pd.DataFrame(d)
df1

   age  height
0   10     120
1   12     130
2   16     140
3   16     150
4    9     110

In [19]:
np.linspace(0, 10, 5)

array([ 0. ,  2.5,  5. ,  7.5, 10. ])

In [20]:
d={
    "age": [60,61, 62, 63, 64],
    "height": [200, 201, 202, 203, 204],    

}
df2 = pd.DataFrame(d)
df2

   age  height
0   60     200
1   61     201
2   62     202
3   63     203
4   64     204

In [25]:
pd.concat([df1, df2], axis=0, ignore_index=True)

   age  height
0   10     120
1   12     130
2   16     140
3   16     150
4    9     110
5   60     200
6   61     201
7   62     202
8   63     203
9   64     204

In [27]:
d1={
    "a": np.arange(5),
    "b": np.random.randint(5),
}

d2={
    "c": np.linspace(5, 100, 5 ),
    "d": np.linspace(100, 200, 5),
}

df1=pd.DataFrame(d1)
df2=pd.DataFrame(d2)
df1, df2

(   a  b
 0  0  2
 1  1  2
 2  2  2
 3  3  2
 4  4  2,
         c      d
 0    5.00  100.0
 1   28.75  125.0
 2   52.50  150.0
 3   76.25  175.0
 4  100.00  200.0)

In [32]:
df1.columns
df2.columns

Index(['c', 'd'], dtype='object')

In [34]:
columns=[col for idx in [df1.columns, df2.columns] for col in df.columns]
columns

[0, 1, 2, 3, 0, 1, 2, 3]

In [35]:
df_cat=pd.concat([df1, df2], axis=1, ignore_index=True)
df_cat

   0  1       2      3
0  0  2    5.00  100.0
1  1  2   28.75  125.0
2  2  2   52.50  150.0
3  3  2   76.25  175.0
4  4  2  100.00  200.0

In [36]:
df_cat.columns

RangeIndex(start=0, stop=4, step=1)

In [40]:
df_cat.rename(columns={0: "a", 1: "b", 2: "c", 3: "d"},inplace=True )
df_cat.rename(columns={"a": "A", "b": "B", "c": "C", "d": "D"},inplace=True )
df_cat

   A  B       C      D
0  0  2    5.00  100.0
1  1  2   28.75  125.0
2  2  2   52.50  150.0
3  3  2   76.25  175.0
4  4  2  100.00  200.0

In [43]:
df=pd.DataFrame(np.array([1, 2, 4, np.nan, np.nan, 7, 8, np.nan]))
df

     0
0  1.0
1  2.0
2  4.0
3  NaN
4  NaN
5  7.0
6  8.0
7  NaN

In [44]:
df.backfill()

/tmp/ipykernel_103971/2806377195.py:1: FutureWarning: DataFrame.backfill/Series.backfill is deprecated. Use DataFrame.bfill/Series.bfill instead
  df.backfill()

     0
0  1.0
1  2.0
2  4.0
3  7.0
4  7.0
5  7.0
6  8.0
7  NaN

In [45]:
df.ffill()

     0
0  1.0
1  2.0
2  4.0
3  4.0
4  4.0
5  7.0
6  8.0
7  8.0

In [46]:
df_cat

   A  B       C      D
0  0  2    5.00  100.0
1  1  2   28.75  125.0
2  2  2   52.50  150.0
3  3  2   76.25  175.0
4  4  2  100.00  200.0

In [47]:
df_cat.A

0    0
1    1
2    2
3    3
4    4
Name: A, dtype: int64

In [48]:
df_cat["A"]

0    0
1    1
2    2
3    3
4    4
Name: A, dtype: int64

In [49]:
df_cat[["A", "B"]]

   A  B
0  0  2
1  1  2
2  2  2
3  3  2
4  4  2